Cult0x7c/HSM-Firmware--STM32-/main.c
void flash_log_read(UART_HandleTypeDef *huart) {
    uint32_t addr = LOG_FLASH_START_ADDR;
    FlashLogEntry entry;
    bool found_logs = false;
    FlashLogEntry last_entry;

    for (int i = 0; i < LOG_MAX_ENTRIES; i++) {
        memcpy(&entry, (void *)addr, sizeof(FlashLogEntry));

        // Break if entry is blank
        bool blank = true;
        for (int j = 0; j < sizeof(FlashLogEntry); j++) {
            if (*((uint8_t *)(addr + j)) != 0xFF) {
                blank = false;
                break;
            }
        }
        if (blank) break;

        entry.message[sizeof(entry.message) - 1] = '\0';

        // Print message
        HAL_UART_Transmit(huart, (uint8_t *)"• ", 2, HAL_MAX_DELAY);
        HAL_UART_Transmit(huart, (uint8_t *)entry.message, strlen(entry.message), HAL_MAX_DELAY);
        HAL_UART_Transmit(huart, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);

        memcpy(&last_entry, &entry, sizeof(FlashLogEntry));
        addr += sizeof(FlashLogEntry);
        found_logs = true;
    }

    if (!found_logs) {
        const char *msg = "⚠️ No logs found.\r\n";
        HAL_UART_Transmit(huart, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
    } else {
        // Send final hash only
        char hash_str[65];
        for (int i = 0; i < 32; i++) {
            snprintf(&hash_str[i * 2], 3, "%02X", last_entry.hash[i]);
        }
        HAL_UART_Transmit(huart, (uint8_t *)"\r\nLatest Hash: ", 15, HAL_MAX_DELAY);
        HAL_UART_Transmit(huart, (uint8_t *)hash_str, 64, HAL_MAX_DELAY);
        HAL_UART_Transmit(huart, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
    }
}


void flash_log_clear(void)
{
    HAL_FLASH_Unlock();

    // Overwrite everything
    for (uint32_t addr = LOG_FLASH_START_ADDR; addr < LOG_FLASH_START_ADDR + LOG_FLASH_PAGE_SIZE; addr += 8) {
        HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, 0xFFFFFFFFFFFFFFFF);
    }

    FLASH_EraseInitTypeDef erase_config = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Banks = FLASH_BANK_2,
        .Page = FLASH_PAGE_NUMBER,
        .NbPages = 1
    };

    // Then delete
    uint32_t page_error = 0;
    HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&erase_config, &page_error);
    if (status != HAL_OK) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"❌ ERASE FAILED!\r\n", 18, HAL_MAX_DELAY);
        HAL_FLASH_Lock();
        return;
    }




    HAL_FLASH_Lock();

    const char *msg = "✅ Flash log cleared.\r\n";
    HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);

    // Verify again
    bool ok = true;
    for (int i = 0; i < LOG_FLASH_PAGE_SIZE; i++) {
        uint8_t b = *(uint8_t *)(LOG_FLASH_START_ADDR + i);
        if (b != 0xFF) {
            char msg[64];
            snprintf(msg, sizeof(msg), "❗ Residual at +0x%03X = 0x%02X\r\n", i, b);
            HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), HAL_MAX_DELAY);
            ok = false;
            break;
        }
    }

    if (ok) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"🧪 Flash verify OK: All 0xFF\r\n", 30, HAL_MAX_DELAY);
    } else {
        HAL_UART_Transmit(&huart2, (uint8_t *)"❗ Flash verify FAILED\r\n", 24, HAL_MAX_DELAY);
    }
}




void generate_random_bytes(uint8_t *buffer, size_t length) {
    for (size_t i = 0; i < length; i += 4) {
        uint32_t random_number;

        // Check if the RNG generation was successful
        if (HAL_RNG_GenerateRandomNumber(&hrng, &random_number) != HAL_OK) {
            // ERROR: TRNG failed
            HAL_UART_Transmit(&huart2, (uint8_t *)"ERROR: TRNG failed!\r\n", 21, HAL_MAX_DELAY);
            Error_Handler();  // Halt execution (optional, or return error)
            return;
        }

        // Prevent buffer overflow for remaining bytes
        if (i + 4 <= length) {
            memcpy(&buffer[i], &random_number, sizeof(uint32_t));
        } else {
            memcpy(&buffer[i], &random_number, length - i);
        }
    }
}

void generate_all_keys(void) {
    for (int i = 0; i < NUM_KEYS; i++) {
        cmox_ecc_construct(&ecc_ctx, CMOX_MATH_FUNCS_SMALL, working_buffer, sizeof(working_buffer));
        generate_random_bytes(random_buffer, RANDOM_BUFFER_SIZE);

        cmox_ecc_retval_t retval;

        retval = cmox_ecdsa_keyGen(
            &ecc_ctx,
            ECC_CURVE_PARAMS,
            random_buffer, RANDOM_BUFFER_SIZE,
            private_keys[i], &private_key_lens[i],
            public_keys[i], &public_key_lens[i]
        );

        if (retval == CMOX_ECC_SUCCESS) {
            // Hash Public Key
            uint8_t pubkey_hash[32];
            cmox_hash_compute(CMOX_SHA256_ALGO, public_keys[i], public_key_lens[i], pubkey_hash, 32, NULL);

            char hex_string[65] = {0};
            for (int j = 0; j < 32; j++) {
                sprintf(&hex_string[j * 2], "%02X", pubkey_hash[j]);
            }

            char cmd[32];
            snprintf(cmd, sizeof(cmd), "GENKEY[%d]", i);
            flash_log_event_with_data(cmd, hex_string);
        }

        char msg[50];
        snprintf(msg, sizeof(msg), "Key[%d] generation %s\r\n", i,
                 (retval == CMOX_ECC_SUCCESS) ? "OK" : "FAILED");
        HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
    }
}


bool is_current_key_valid(void) {
    return (private_key_lens[current_key_index] == ECC_PRIVATE_KEY_SIZE &&
            public_key_lens[current_key_index] == ECC_PUBLIC_KEY_SIZE);
}


void send_public_key_to_pc(void) {
    if (!is_current_key_valid()) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"No public key to send. Use GENKEY first.\r\n", 45, HAL_MAX_DELAY);
        return;
    }

    HAL_UART_Transmit(&huart2, (uint8_t *)"[PUBKEY]\r\n", 10, HAL_MAX_DELAY); // Marker with newline

    // Send currently selected public key
    HAL_UART_Transmit(&huart2, public_keys[current_key_index], ECC_PUBLIC_KEY_SIZE, HAL_MAX_DELAY);

    HAL_UART_Transmit(&huart2, (uint8_t *)"[ENDKEY]\r\n", 10, HAL_MAX_DELAY); // Marker with newline

    // 🔐 Compute and log hash of the sent public key
    uint8_t pubkey_hash[32];
    cmox_hash_compute(CMOX_SHA256_ALGO,
                      public_keys[current_key_index],
                      ECC_PUBLIC_KEY_SIZE,
                      pubkey_hash,
                      sizeof(pubkey_hash),
                      NULL);

    char hex_string[65] = {0};
    for (int i = 0; i < 32; i++) {
        sprintf(&hex_string[i * 2], "%02X", pubkey_hash[i]);
    }

    char cmd[32];
    snprintf(cmd, sizeof(cmd), "SENDPUB[%d]", current_key_index);
    flash_log_event_with_data(cmd, hex_string);
}


void flush_uart_buffer(void) {
    uint8_t dummy;
    while (HAL_UART_Receive(&huart2, &dummy, 1, 10) == HAL_OK) {} // Leere den Buffer
}

