Cult0x7c/HSM-Firmware--STM32-/main.c
void print_computed_hash(uint8_t *hash, size_t length) {
    char hash_str[65]; // 32 bytes * 2 characters per byte + null terminator

    for (size_t i = 0; i < length; i++) {
        snprintf(&hash_str[i * 2], 3, "%02X", hash[i]);  // Convert to hex string
    }

    // Send the computed hash over UART
    HAL_UART_Transmit(&huart2, (uint8_t *)"Computed Hash: ", 15, HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)hash_str, strlen(hash_str), HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
}

void sign_message() {
	if (!is_current_key_valid()) {
	    HAL_UART_Transmit(&huart2, (uint8_t *)"No valid key available. Use GENKEY first.\r\n", 45, HAL_MAX_DELAY);
	    return;
	}

    cmox_ecc_retval_t retval;
    uint8_t random_data[32];
    size_t computed_size;
    uint8_t received_byte;
    size_t msg_index = 0;
    uint8_t message[MESSAGE_MAX_LEN];

    HAL_UART_Transmit(&huart2, (uint8_t *)"Waiting for message...\r\n", 24, HAL_MAX_DELAY);

    // Read message until we receive [ENDSIGN]
    while (msg_index < MESSAGE_MAX_LEN - 1) {
        HAL_UART_Receive(&huart2, &received_byte, 1, HAL_MAX_DELAY);

        if (received_byte == '[') {
            // Check for the end marker
            uint8_t buffer[8] = {0};
            HAL_UART_Receive(&huart2, buffer, 8, HAL_MAX_DELAY);
            if (strncmp((char *)buffer, "ENDSIGN]", 8) == 0) {
                break;  // Exit the loop
            }
        }

        // Ignore newline and carriage return characters
        if (received_byte != '\r' && received_byte != '\n') {
            message_buffer[msg_index++] = received_byte;
        }
    }

    HAL_UART_Transmit(&huart2, (uint8_t *)"Message Received!\r\n", 19, HAL_MAX_DELAY);

    printf(message_buffer);

    // Compute SHA-256 HASH
    retval = cmox_hash_compute(
        CMOX_SHA256_ALGO,
		message_buffer, msg_index,
        computed_hash,
        CMOX_SHA256_SIZE,
        &computed_size
    );

    if (retval != CMOX_HASH_SUCCESS) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"ERROR: Hashing failed\r\n", 23, HAL_MAX_DELAY);
    } else {
    	print_computed_hash(computed_hash, CMOX_SHA256_SIZE);
    	HAL_UART_Transmit(&huart2, (uint8_t *)"SHA-256 Hash Computed Successfully!\r\n", 38, HAL_MAX_DELAY);
    }

    // Convert hash to hex string for logging
    char hash_hex[65] = {0};
    for (int i = 0; i < CMOX_SHA256_SIZE; i++) {
        sprintf(&hash_hex[i * 2], "%02X", computed_hash[i]);
    }

    // Format log entry
    char cmd[32];
    snprintf(cmd, sizeof(cmd), "SIGN[%d]", current_key_index);
    flash_log_event_with_data(cmd, hash_hex);


    // Initialize ECC context
    //cmox_ecc_construct(&ecc_ctx, CMOX_MATH_FUNCS_SMALL, working_buffer, sizeof(working_buffer));

    generate_random_bytes(random_buffer, sizeof(random_buffer));  // Fill buffer with randomness

    // Sign the message hash
    retval = cmox_ecdsa_sign(
        &ecc_ctx,
        CMOX_ECC_CURVE_SECP256R1,
        random_buffer, sizeof(random_buffer),
        private_keys[current_key_index], private_key_lens[current_key_index],
        computed_hash, CMOX_SHA256_SIZE,
        computed_signature, &computed_size
    );


    if (retval == CMOX_ECC_SUCCESS) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"✅ STM32 Self Verification SUCCESS\r\n", 36, HAL_MAX_DELAY);
    } else {
        HAL_UART_Transmit(&huart2, (uint8_t *)"❌ STM32 Self Verification FAILED\r\n", 35, HAL_MAX_DELAY);
    }

    // Clean up ECC context
    //cmox_ecc_cleanup(&ecc_ctx);

    // Check if signing was successful
    if (retval != CMOX_ECC_SUCCESS) {
        char *error_msg = "ERROR: Signing failed\r\n";
        HAL_UART_Transmit(&huart2, (uint8_t *)error_msg, strlen(error_msg), HAL_MAX_DELAY);
        return;
    }

    // Send acknowledgment
    HAL_UART_Transmit(&huart2, (uint8_t *)"[SIGN]\r\n", 8, HAL_MAX_DELAY);

    // Send the ECDSA signature (64 bytes)
    HAL_UART_Transmit(&huart2, computed_signature, SIGNATURE_SIZE, HAL_MAX_DELAY);

    // Send end marker
    HAL_UART_Transmit(&huart2, (uint8_t *)"[ENDSIGN]\r\n", 11, HAL_MAX_DELAY);
}

void key_info(void) {
    char buffer[100];

    for (int i = 0; i < NUM_KEYS; i++) {
        int is_valid = (private_key_lens[i] > 0 && public_key_lens[i] > 0);

        if (is_valid) {
            snprintf(buffer, sizeof(buffer), "Key %d (HEX)%s:\r\n",
                     i, (i == current_key_index) ? " [aktiv]" : "");
            HAL_UART_Transmit(&huart2, (uint8_t *)buffer, strlen(buffer), HAL_MAX_DELAY);

            for (int j = 0; j < ECC_PUBLIC_KEY_SIZE; j++) {
                snprintf(buffer, sizeof(buffer), "%02X", public_keys[i][j]);
                HAL_UART_Transmit(&huart2, (uint8_t *)buffer, 2, HAL_MAX_DELAY);

                if ((j + 1) % 32 == 0)
                    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
            }

        } else {
            snprintf(buffer, sizeof(buffer), "Key %d: ❌ empty\r\n", i);
            HAL_UART_Transmit(&huart2, (uint8_t *)buffer, strlen(buffer), HAL_MAX_DELAY);
        }
    }
}



void delete_all_keys(void) {
    for (int i = 0; i < NUM_KEYS; i++) {
        memset(private_keys[i], 0, ECC_PRIVATE_KEY_SIZE);
        memset(public_keys[i], 0, ECC_PUBLIC_KEY_SIZE);
        private_key_lens[i] = 0;
        public_key_lens[i] = 0;
    }
    current_key_index = 0;

    HAL_UART_Transmit(&huart2, (uint8_t *)"All keys deleted. Reset to key index 0.\r\n", 42, HAL_MAX_DELAY);
}

void set_rtc_from_command(char *cmd, UART_HandleTypeDef *huart)
{
    int year, month, day, hour, min, sec;

    // Expecting format: "SETRTC YYYY-MM-DD HH:MM:SS"
    if (sscanf(cmd, "SETRTC %d-%d-%d %d:%d:%d",
               &year, &month, &day, &hour, &min, &sec) == 6)
    {
        RTC_TimeTypeDef sTime = {0};
        RTC_DateTypeDef sDate = {0};

        sTime.Hours   = hour;
        sTime.Minutes = min;
        sTime.Seconds = sec;

        sDate.Year  = year - 2000;  // RTC stores 0–99 (for 2000–2099)
        sDate.Month = month;
        sDate.Date  = day;
        sDate.WeekDay = RTC_WEEKDAY_MONDAY;

        if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) == HAL_OK &&
            HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) == HAL_OK)
        {
            const char *ok = "✅ RTC updated.\r\n";
            HAL_UART_Transmit(huart, (uint8_t*)ok, strlen(ok), HAL_MAX_DELAY);
        }
        else
        {
            const char *fail = "❌ RTC update failed.\r\n";
            HAL_UART_Transmit(huart, (uint8_t*)fail, strlen(fail), HAL_MAX_DELAY);
        }
    }
    else
    {
        const char *syntax = "❌ Invalid format. Use: SETRTC YYYY-MM-DD HH:MM:SS\r\n";
        HAL_UART_Transmit(huart, (uint8_t*)syntax, strlen(syntax), HAL_MAX_DELAY);
    }
}

void process_command(void) {
    char command_buffer[64] = {0};  // Buffer for command
    size_t index = 0;

    flush_uart_buffer();  // Clear UART buffer

    // Read command until newline ('\n') is received
    while (index < sizeof(command_buffer) - 1) {
        uint8_t byte;
        HAL_UART_Receive(&huart2, &byte, 1, HAL_MAX_DELAY);

        if (byte == '\r' || byte == '\n') {  // Accept both '\n' and '\r\n' {
            command_buffer[index] = '\0';
            break;
        }
        command_buffer[index++] = byte;
    }

    HAL_UART_Transmit(&huart2, (uint8_t *)"\nReceived: ", 11, HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)command_buffer, strlen(command_buffer), HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);

    // Check command and execute corresponding function
    if (strcmp(command_buffer, "GENKEY") == 0) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"Generating new key pairs...\r\n", 29, HAL_MAX_DELAY);
        generate_all_keys();
    }
    else if (strcmp(command_buffer, "SENDPUB") == 0) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"Sending public key...\r\n", 24, HAL_MAX_DELAY);
        send_public_key_to_pc();
    }
    else if (strcmp(command_buffer, "SIGN") == 0) {
        //HAL_UART_Transmit(&huart2, (uint8_t *)"Waiting for message to sign...\r\n", 32, HAL_MAX_DELAY);
        sign_message();
    }
    else if (strcmp(command_buffer, "DELKEYS") == 0) {
        delete_all_keys();
    }
    else if (strcmp(command_buffer, "KEYINFO") == 0) {
        key_info();
    }
    else if (strcmp(command_buffer, "GETLOGS") == 0) {
        flash_log_read(&huart2);
    }
    else if (strncmp((char*)command_buffer, "CLEARLOGS", 9) == 0) {
        flash_log_clear();
    }
    else if (strncmp((char*)command_buffer, "SETRTC", 6) == 0) {
        set_rtc_from_command((char*)command_buffer, &huart2);
    }


    else if (strncmp(command_buffer, "USEKEY", 6) == 0) {
        int key_idx = atoi(&command_buffer[6]);
        if (key_idx >= 0 && key_idx < NUM_KEYS) {
            current_key_index = key_idx;
            char msg[40];
            snprintf(msg, sizeof(msg), "Using key index %d\r\n", current_key_index);
            HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
        } else {
            HAL_UART_Transmit(&huart2, (uint8_t *)"Invalid key index!\r\n", 21, HAL_MAX_DELAY);
        }
    }

